Intro/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-13 Thu 11:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Interpretation Pipeline</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="../toc.html">↩</a></div><div id="content" class="content">
<h1 class="title">The Interpretation Pipeline</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6280b5e">Interpretation vs. Compilation</a></li>
<li><a href="#org11a65f8">Interpretation Pipeline</a></li>
<li><a href="#orgbffb97f">Expectations</a></li>
</ul>
</div>
</div>
<p>
When we write a program in our favorite PL<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> we fill a file with a bunch of symbols and text.
This is one of the beauties of programming: looking past the bells and
whistles provided IDEs, a program is just a stream of characters.
</p>

<p>
Eventually we want to verify that what we've typed up written actually
works, so we <i>run</i> our program.  In some IDEs, this means pressing a
play button.  In many cases it means opening a terminal and typing out
a few commands.
</p>

<p>
In either case, we're running a <i>different</i> program in order to run
the program we've written (huh).  Our goal is to understand what's
going on here. <i>What is this program doing? How does it do it? What
sorts of data structures does this program use?</i> Our intuition should
tell us this program is doing probably something complicated.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<p>
So, our basic question is: <i>How do we get from that stream of symbols
to the <b>output</b> of our program?</i>
</p>
<div id="outline-container-org6280b5e" class="outline-2">
<h2 id="org6280b5e">Interpretation vs. Compilation</h2>
<div class="outline-text-2" id="text-org6280b5e">
<p>
We start by making a loose but important distinction between
<b>interpretation</b> and <b>compilation</b>.  At the risk of oversimplifying,
we'll use the following definitions.
</p>

<ul class="org-ul">
<li><p>
<b>Interpretation</b> is the process of taking a source program and
its input, and then running it to get its output.
</p>
<div class="org-src-container">
<pre class="src src-ascii">char stream ────►┌─────────────┐
                 │ INTERPRETER │────► output
      input ────►└─────────────┘
</pre>
</div></li>
<li><p>
<b>Compilation</b> is the process of taking a source program in a
high-level language and then <i>translating it</i> into a program in a
low-level language which can be given input and run separately.
</p>
<div class="org-src-container">
<pre class="src src-ascii">                 ┌──────────┐
char stream ────►│ COMPILER │─╮
                 └──────────┘ │
          ╭─low-level program─╯
          │
          ╰─────►┌──────────┐
                 │  TARGET  │───► output
      input ────►└──────────┘
</pre>
</div></li>
</ul>

<p>
Again, this is a loose distinction. There may be intermediate
translations in the process of interpretation (this is what OCaml
does).  We'll look briefly at compilation in this course but we'll
focus primarily on interpretation.
</p>
</div>
</div>
<div id="outline-container-org11a65f8" class="outline-2">
<h2 id="org11a65f8">Interpretation Pipeline</h2>
<div class="outline-text-2" id="text-org11a65f8">
<p>
So, <i>what's happening inside an interpreter?</i> We start with a diagram.
We can think of this image as providing a window into the
<code>INTERPRETER</code> box above.
</p>

<div class="org-src-container">
<pre class="src src-ascii">                 +----------------------------+
                 |   ┌────────────────────┐   |
char stream ────────►│  LEXICAL ANALYSIS  │─╮ |
                 |   └────────────────────┘ │ |
                 | ╭──────token stream──────╯ |
                 | │ ┌────────────────────┐   |
                 | ╰►│ SYNTACTIC ANALYSIS │─╮ |
                 |   └────────────────────┘ │ |
                 | ╭───────parse tree───────╯ |
                 | │ ┌────────────────────┐   |
                 | ╰►│  SEMANTIC ANALYSIS │─╮ |
                 |   └────────────────────┘ │ |
                 | ╭─────────AST/IR─────────╯ |
                 | ╰►┌────────────────────┐   |
      input ────────►│     EVALUATION     │────────► output
                 |   └────────────────────┘   |
                 +----------------------------+
</pre>
</div>

<ul class="org-ul">
<li>The first two boxes turn a stream of characters into something that
we can <i>evaluate</i> (i.e., that we can run).  This part of
interpretation is about the <i>form</i> (or <i>syntax</i>) of the program.
We'll use <b>formal grammars</b> to represent this form mathematically
and we'll use <b>parser generators</b> to set up the code for these two
boxes.  Just like natural language, PLs are hierarchical, and making
that heirarchical structure explicit makes evaluation easier.</li>

<li>The next box is where we do <b>type checking</b> and/or <b>type inference</b>.
It's during this part of the pipeline that we verify if the program
we're planning to evaluate actually makes sense.  If it does, then
we can pass it onto the evaluator.</li>

<li>The last box actually runs our program to get its <i>value</i> (i.e., its
output).  This part of interpetation is about the <i>meaning</i> (or
<i>semantics</i>) of the program.  We use <b>formal semantics</b> to describe
what it means to give a program this meaning.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbffb97f" class="outline-2">
<h2 id="orgbffb97f">Expectations</h2>
<div class="outline-text-2" id="text-orgbffb97f">
<p>
PL has implications both in theory and in practice.  It will be
important for us not just to think about how to implement an
interpreter, but also about the underlying logical frameworks we need
to reason about PLs.
</p>

<p>
There will be a frequent give-and-take between theory and practice.
Be prepared to do handwritten work (not quite proofs, but something
akin to them) as well as programming (i.e., building the components
interpreter).
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">I presume at this point
that yours is OCaml.</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">Just
think of how hard it is to follow directions, how often we wish we
read <i>all</i> the instructions before starting some task.</p></div></div>


</div>
</div></div>
</body>
</html>
